In [13]:
import pandas as pd
import numpy as np

In [15]:
df = pd.read_csv('data/original/census.csv')
df.head()

,age,workclass,fnlgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [17]:
df['salary'].value_counts()

salary
<=50K    24720
>50K      7841
Name: count, dtype: int64

In [18]:
df['salary'] = df['salary'].map(lambda x: 1 if x=='>50K' else 0)

In [19]:
df['salary'].value_counts()

salary
0    24720
1     7841
Name: count, dtype: int64

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32561 entries, 0 to 32560
Data columns (total 15 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   age             32561 non-null  int64
 1   workclass       32561 non-null  object
 2   fnlgt           32561 non-null  int64
 3   education       32561 non-null  object
 4   education-num   32561 non-null  int64
 5   marital-status  32561 non-null  object
 6   occupation      32561 non-null  object
 7   relationship    32561 non-null  object
 8   race            32561 non-null  object
 9   sex             32561 non-null  object
 10  capital-gain    32561 non-null  int64
 11  capital-loss    32561 non-null  int64
 12  hours-per-week  32561 non-null  int64
 13  native-country  32561 non-null  object
 14  salary          32561 non-null  object
dtypes: int64(6), object(9)
memory usage: 3.7+ MB

In [4]:
df.describe()

,age,fnlgt,education-num,capital-gain,capital-loss,hours-per-week
count,32561.000000,3.256100e+04,32561.000000,32561.000000,32561.000000,32561.000000
mean,38.581647,1.897784e+05,10.080679,1077.648844,87.303830,40.437456
std,13.640433,1.055500e+05,2.572720,7385.292085,402.960219,12.347429
min,17.000000,1.228500e+04,1.000000,0.000000,0.000000,1.000000
25%,28.000000,1.178270e+05,9.000000,0.000000,0.000000,40.000000
50%,37.000000,1.783560e+05,10.000000,0.000000,0.000000,40.000000
75%,48.000000,2.370510e+05,12.000000,0.000000,0.000000,45.000000
max,90.000000,1.484705e+06,16.000000,99999.000000,4356.000000,99.000000

In [5]:
df['salary'].unique()

array(['<=50K', '>50K'], dtype=object)

In [6]:
df = df.map(lambda x: x.strip().lower() if isinstance(x, str) else x)

In [7]:
df['salary'] = df['salary'].map(lambda x: 1 if x=='>50K' else 0)

In [21]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32561 entries, 0 to 32560
Data columns (total 15 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   age             32561 non-null  int64
 1   workclass       32561 non-null  object
 2   fnlgt           32561 non-null  int64
 3   education       32561 non-null  object
 4   education-num   32561 non-null  int64
 5   marital-status  32561 non-null  object
 6   occupation      32561 non-null  object
 7   relationship    32561 non-null  object
 8   race            32561 non-null  object
 9   sex             32561 non-null  object
 10  capital-gain    32561 non-null  int64
 11  capital-loss    32561 non-null  int64
 12  hours-per-week  32561 non-null  int64
 13  native-country  32561 non-null  object
 14  salary          32561 non-null  int64
dtypes: int64(7), object(8)
memory usage: 3.7+ MB

In [8]:
df.sample(15)

,age,workclass,fnlgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
6628,49,private,123584,11th,7,married-civ-spouse,transport-moving,husband,white,male,0,0,75,united-states,0
13367,52,private,204584,bachelors,13,married-spouse-absent,exec-managerial,not-in-family,white,female,0,0,42,united-states,0
29063,45,self-emp-not-inc,162923,hs-grad,9,married-civ-spouse,craft-repair,husband,white,male,0,0,60,united-states,0
7606,43,self-emp-not-inc,154785,bachelors,13,married-civ-spouse,machine-op-inspct,wife,asian-pac-islander,female,0,0,80,thailand,0
8713,55,private,113912,assoc-voc,11,married-civ-spouse,prof-specialty,wife,white,female,0,0,20,united-states,0
29040,34,?,222548,some-college,10,married-civ-spouse,?,wife,white,female,0,0,4,united-states,0
23994,43,private,184321,10th,6,married-civ-spouse,machine-op-inspct,husband,black,male,0,1887,40,united-states,0
22501,20,private,173736,9th,5,never-married,machine-op-inspct,own-child,white,male,0,0,40,united-states,0
26054,43,private,191765,hs-grad,9,divorced,tech-support,unmarried,black,female,0,0,35,united-states,0
22423,17,private,566049,10th,6,never-married,other-service,own-child,white,male,0,0,8,united-states,0
1252,30,private,283767,hs-grad,9,married-civ-spouse,adm-clerical,husband,white,male,0,0,40,?,0
11701,67,self-emp-inc,411007,hs-grad,9,widowed,exec-managerial,not-in-family,white,female,15831,0,40,united-states,0
30333,30,local-gov,289442,hs-grad,9,never-married,protective-serv,not-in-family,white,male,0,0,40,united-states,0
18783,32,self-emp-not-inc,27939,some-college,10,married-civ-spouse,sales,husband,amer-indian-eskimo,male,0,0,60,united-states,0
13440,22,private,183257,some-college,10,never-married,sales,own-child,black,female,0,0,20,united-states,0

In [20]:
df.to_csv('data/census.csv')

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32561 entries, 0 to 32560
Data columns (total 15 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   age             32561 non-null  int64
 1   workclass       32561 non-null  object
 2   fnlgt           32561 non-null  int64
 3   education       32561 non-null  object
 4   education-num   32561 non-null  int64
 5   marital-status  32561 non-null  object
 6   occupation      32561 non-null  object
 7   relationship    32561 non-null  object
 8   race            32561 non-null  object
 9   sex             32561 non-null  object
 10  capital-gain    32561 non-null  int64
 11  capital-loss    32561 non-null  int64
 12  hours-per-week  32561 non-null  int64
 13  native-country  32561 non-null  object
 14  salary          32561 non-null  int64
dtypes: int64(7), object(8)
memory usage: 3.7+ MB